---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.BeamFailures
source: html/40091dec-aced-306f-8d53-d4b4bfb6520d.htm
---
# BuiltInFailures.BeamFailures Properties

Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp.
 You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve.